_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 65536, 32)         320       
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 65536, 32)         9248      
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 16384, 32)         0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 16384, 64)         18496     
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 16384, 64)         36928     
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 4096, 64)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 262144)            0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 262144)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               33554560  
_________________________________________________________________
dense_2 (Dense)              (None, 32)                4128      
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 33        
=================================================================
Total params: 33,623,713
Trainable params: 33,623,713
Non-trainable params: 0
_________________________________________________________________
