_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 4096, 32)          320       
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 4096, 32)          9248      
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 1024, 32)          0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 1024, 64)          18496     
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 1024, 64)          36928     
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 256, 64)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 16384)             0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 16384)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               2097280   
_________________________________________________________________
dense_2 (Dense)              (None, 32)                4128      
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 33        
=================================================================
Total params: 2,166,433
Trainable params: 2,166,433
Non-trainable params: 0
_________________________________________________________________
